app/controllers/statuses_controller.rb

  def create
    @status = current_user.statuses.new(params[:status])

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "This is the content"], ["created_at", Thu, 16 Jul 2015 15:09:31 UTC +00:00], ["updated_at", Thu, 16 Jul 2015 15:09:31 UTC +00:00], ["user_id", nil]]

  def update
    @status = current_user.statuses.find(params[:id])
    if params[:status] && params[:status].has_key?(:user_id)
      params[:status].delete(:user_id)
    end
    respond_to do |format|
      if @status.update_attributes(params[:status])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = 1 AND "statuses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "statuses" SET "content" = '123', "updated_at" = '2015-07-20 17:26:03.205204' WHERE "statuses"."id" = 7

  def destroy
    @status = Status.find(params[:id])
    @status.destroy
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 2]]